app/Controllers/AuthController.php

    public function loginAuth()
    {
        $session = session();
        $model = new UserModel();
        $loginAttemptModel = new LoginAttemptModel();

        // Coleta od dados do formulario
        $agency  = $this->request->getVar('agency');
        $account = $this->request->getVar('account');
        $cpf     = $this->request->getVar('cpf');
        $password = $this->request->getVar('password');

        // Verifica se o usuario excedeu o número de tentativas de acesso
        $attempts = $loginAttemptModel->getAttempts($agency, $account);

        if ($attempts >= 3) {
            $session->setFlashdata('msg', 'Muitas tentativas falhas. Aguarde 30 minutos para tentar novamente.');
            return redirect()->to('/');
        }

        // Busca usuario com base em agência, conta e CPF
        $data = $model->where([
            'agency_number'  => $agency,
            'account_number' => $account,
            'cpf'            => $cpf,
        ])->first();
---
SELECT *
FROM `users`
WHERE `agency_number` = '1234'
AND `account_number` = '1001'
AND `cpf` = '688.450.740-30'
 LIMIT 1