app/Controllers/WalletController.php

    private function getLoggedUser()
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function dashboard()
    {
        $user = $this->getLoggedUser();
        if (!$user) {
            return redirect()->to('/')->with('msg', 'Usuário não encontrado.');
        }

        $transactions = $this->transactionModel
            ->where('user_id', $user['id'])
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `transactions`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC

    public function depositView()
    {
        helper(['form']);
        $user = $this->getLoggedUser();
        if (!$user) {
            return redirect()->to('/')->with('msg', 'Usuário não encontrado.');
        }

        $perPage = 5;
        $page = $this->request->getVar('page') ?? 1;

        $transactions = $this->transactionModel
            ->where('user_id', $user['id'])
            ->where('type', 'deposit')
            ->orderBy('created_at', 'DESC')
            ->paginate($perPage, 'default', (int) $page);

        $total = $this->transactionModel
            ->where('user_id', $user['id'])
            ->where('type', 'deposit')
            ->countAllResults();
---
SELECT *
FROM `transactions`
WHERE `user_id` = '1'
AND `type` = 'deposit'
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `user_id` = '1'
AND `type` = 'deposit'

    public function transferView()
    {
        $user = $this->getLoggedUser();
        if (!$user) {
            return redirect()->to('/')->with('msg', 'Usuário não encontrado.');
        }

        $perPage = 5;
        $page = $this->request->getVar('page') ?? 1;

        $transactions = $this->transactionModel
            ->where('user_id', $user['id'])
            ->where('type', 'transfer')
            ->orderBy('created_at', 'DESC')
            ->paginate($perPage, 'default', (int) $page);

        $total = $this->transactionModel
            ->where('user_id', $user['id'])
            ->countAllResults();
---
SELECT *
FROM `transactions`
WHERE `user_id` = '1'
AND `type` = 'transfer'
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `user_id` = '1'
AND `type` = 'transfer'
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `user_id` = '1'