app/Models/LoginAttemptModel.php

    public function getAttempts($agency, $account)
    {
        $timeLimit = date('Y-m-d H:i:s', strtotime('-30 minutes'));

        return $this->where('agency_number', $agency)
            ->where('account_number', $account)
            ->where('success', 0)
            ->where('attempted_at >', $timeLimit)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `login_attempts`
WHERE `agency_number` = '1234'
AND `account_number` = '1001'
AND `success` = 0
AND `attempted_at` > '2025-05-25 22:42:30'