app/Models/LoginAttemptModel.php

INSERT INTO `login_attempts` (`agency_number`, `account_number`, `success`, `attempted_at`) VALUES ('1234', '1001', 0, '2025-05-12 10:10:31')
---
    public function logAttempt($agency, $account, $success)
    {
        $this->insert([
            'agency_number'  => $agency,
            'account_number' => $account,
            'success'        => $success ? 1 : 0,
            'attempted_at'   => date('Y-m-d H:i:s'),
        ]);

SELECT COUNT(*) AS `numrows`
FROM `login_attempts`
WHERE `agency_number` = '1234'
AND `account_number` = '1001'
AND `success` = 0
AND `attempted_at` > '2025-05-12 09:40:30'
---
    public function getAttempts($agency, $account)
    {
        $timeLimit = date('Y-m-d H:i:s', strtotime('-30 minutes'));

        return $this->where('agency_number', $agency)
            ->where('account_number', $account)
            ->where('success', 0)
            ->where('attempted_at >', $timeLimit)
            ->countAllResults();